# x=int(input("Введите число из диапазона 1-7:"))
# if x==1:
#     print("понедельник")
# elif x==2:
#     print("вторник")
# elif x==3:
#     print("среда")
# elif x==4:
#     print("четверг")
# elif x==5:
#     print("пятница")
# elif x==6:
#     print("суббота")
# elif x==7:
#     print("воскресенье")

week={
    1 : "понедельник",
    2 : "вторник",
    3 : "среда",
    4 : "четверг",
    5 : "пятница",
    6 : "суббота",
    7 : "воскресенье"}
x=int(input("Введите число из диапазона 1-7:"))
if x in range(1,8): print("День недели: ", week[x].capitalize())
else: print("ошибка")