# x=int(input("Введите номер месяца от 1 до 12:"))
# if x==1 or x==2 or x==12:
#     print("Зима")
# elif x==3 or x==4 or x==5:
#     print("Весна")
# elif x==6 or x==7 or x==8:
#     print("Лето")
# elif x==9 or x==10 or x==11:
#     print("Осень")

mesyac={1 : "Январь", 
        2 : "Февраль", 
        3 : "Март", 
        4 : "Апрель",
        5 : "Май",
        6 : "Июнь",
        7 : "Июль",
        8 : "Август",
        9 : "Сентябрь",
        10 : "Октябрь",
        11 : "Ноябрь", 
        12 : "Декабрь"}
sizon={1:"Зима", 2:"Весна", 3:"Лето", 4:"Осень"}
x=int(input("Введите номер месяца от 1 до 12: "))
# if x in [1,2,12]:
if x==[1,2,12]: print("Месяц:",mesyac[x], "\n" "Время года:", sizon[1])
elif x in [3,4,5]: print("Месяц:",mesyac[x], "\n" "Время года:", sizon[2])
elif x in [6,7,8]: print("Месяц:",mesyac[x], "\n" "Время года:", sizon[3])
elif x in [9,10,11]: print("Месяц:",mesyac[x], "\n" "Время года:", sizon[4])
elif x<1 or x>12: print("Ошибка")