x=int(input("Введите номер месяца от 1 до 12:"))
# if x%2==0 and x!=2:
#     print("В данном месяце 30 дней")
# elif x%2==1:
#     print("В данном месяце 31 день")
# elif x==2:
#     print("В данном месяце 28 дней")

mesyac={1 : "Январь", 
        2 : "Февраль", 
        3 : "Март", 
        4 : "Апрель",
        5 : "Май",
        6 : "Июнь",
        7 : "Июль",
        8 : "Август",
        9 : "Сентябрь",
        10 : "Октябрь",
        11 : "Ноябрь", 
        12 : "Декабрь"}
dney={0:"В данном месяце 30 дней", 1:"В данном месяце 31 день", 2:"В данном месяце 28 дней"}
if x in [2]: print("Месяц: ", mesyac[x], "\n", dney[2])
elif x in [1,3,5,7,8,10,12]: print("Месяц: ", mesyac[x], "\n", dney[1])
elif x in [4,6,9,11]: print("Месяц: ", mesyac[x], "\n", dney[0])