d = {'С' : 'Север', 'З' : 'Запад', 'Ю' : 'Юг', 'B' : 'Восток'}
r = {-1 : "поворот направо", 0 : "продолжать движение", 1 : "поворот налево"}
d1 = {0 : 'С', 1: 'З',  2 : 'Ю', 3 : 'B'}
i = int(input("Исходное направление(0-Север, 1-Запад, 2-Юг, 3-Восток): "))
C = d[d1[i]]
print("Исходное направление: ", C)
N = int(input("Команды(-1-поворот направо, 0-продолжать движение, 1-поворот налево) "))
print("Поворот: ", r[N])
if N == -1:
    if i == 0:
        i = 3
    elif i == 3:
        i = 2
    elif i == 2:
        i = 1
    elif i == 1:
        i == 0
elif N == 1:
    if i == 0:
        i = 1
    elif i == 1:
        i = 2
    elif i == 2:
        i = 3
    elif i == 3:
        i = 0
C = d[d1[i]]
print("Новое направление (C) : ", C)